Tekla Open API Reference for Tekla Structures 2025
InputObjectTypeAttribute Properties
The InputObjectTypeAttribute type exposes the following members.
Properties
Name | Description
Type
 The custom attribute [InputObjectType()] uses this to store the input object type to the system. This is not to be used by itself.
Top
See Also
Reference
InputObjectTypeAttribute Class
Tekla.Structures.Plugins Namespace